--- crates/shared/src/payload_pool.rs
+++ replace <impl Deref for Recycled<T>>::deref -> &T with Box::leak(Box::new(Default::default()))
@@ -264,19 +264,17 @@
     pool: Arc<RecycleInner<T>>,
 }
 
 impl<T: Recyclable> Deref for Recycled<T> {
     type Target = T;
 
     #[inline]
     fn deref(&self) -> &T {
-        self.slot
-            .as_ref()
-            .expect("a live recycled payload owns its slot")
+        Box::leak(Box::new(Default::default())) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl<T: Recyclable> DerefMut for Recycled<T> {
     #[inline]
     fn deref_mut(&mut self) -> &mut T {
         self.slot
             .as_mut()
