--- crates/shared/src/payload_pool.rs
+++ replace <impl DerefMut for Recycled<T>>::deref_mut -> &mut T with Box::leak(Box::new(Default::default()))
@@ -273,19 +273,17 @@
             .as_ref()
             .expect("a live recycled payload owns its slot")
     }
 }
 
 impl<T: Recyclable> DerefMut for Recycled<T> {
     #[inline]
     fn deref_mut(&mut self) -> &mut T {
-        self.slot
-            .as_mut()
-            .expect("a live recycled payload owns its slot")
+        Box::leak(Box::new(Default::default())) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl<T: Recyclable + fmt::Debug> fmt::Debug for Recycled<T> {
     fn fmt(&self, formatter: &mut fmt::Formatter<'_>) -> fmt::Result {
         self.deref().fmt(formatter)
     }
 }
