--- crates/shared/src/payload_pool.rs
+++ replace <impl Drop for Pooled<T>>::drop with ()
@@ -111,30 +111,17 @@
 impl<T: fmt::Debug> fmt::Debug for Pooled<T> {
     fn fmt(&self, formatter: &mut fmt::Formatter<'_>) -> fmt::Result {
         self.deref().fmt(formatter)
     }
 }
 
 impl<T> Drop for Pooled<T> {
     fn drop(&mut self) {
-        let mut slot = self
-            .slot
-            .take()
-            .expect("a pooled payload returns its slot exactly once");
-        // SAFETY: the slot is initialized for the entire Pooled lifetime and
-        // becomes uninitialized again before it is returned to the free list.
-        unsafe { slot.value.assume_init_drop() };
-        match self.pool.free_tx.try_send(slot) {
-            Ok(()) => {}
-            // Both cases indicate an invariant failure or final teardown. The
-            // value has already been dropped, so releasing the empty allocation
-            // is safe and preferable to panicking in Drop.
-            Err(TrySendError::Full(slot) | TrySendError::Disconnected(slot)) => drop(slot),
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// A payload whose slot is reset in place rather than dropped.
 ///
 /// `recycle` runs on the consumer's thread when the loan falls out of scope. It
 /// decides what the slot keeps: the contents are gone either way, so what it is
 /// really choosing is which allocations survive to serve the next event.
