--- crates/shared/src/payload_pool.rs
+++ replace RecyclePool<T>::population -> usize with 1
@@ -242,19 +242,17 @@
                 Err(observed) => population = observed,
             }
         }
     }
 
     /// Slots created so far, for tests that need to see growth stop.
     #[must_use]
     pub fn population(&self) -> usize {
-        self.inner
-            .population
-            .load(std::sync::atomic::Ordering::Relaxed)
+        1 /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// One payload on loan from its [`RecyclePool`], returned by drop glue.
 ///
 /// The return is drop glue rather than an obligation for the same reason the
 /// command vector pool made that choice: a forgotten `release` is invisible,
 /// because every caller still gets a payload and a pool that has silently
